y = ''
v = 'smth.'
#БАЛЛЫ СКГЛ
skgl = 0
if "29Б" in y:
    skgl += 1
elif "28Б" in y:
    skgl += 2
elif ("1А" and ("4А" or "4Б" or "4В") and ("14Б" or "14В"  or  "12Б"  or  "13Б" or "13В")) in y:
    skgl += 2
elif ("1А" and ("4А" or "4Б" or "4В") and "19Б") in y:
    skgl += 1
elif ("1Б" and ("4А" or "4Б" or "4В" or "4Г") and ("14Б" or "14В"  or  "12Б"  or  "13Б" or "13В")) in y:
    skgl += 2
elif ("1Б" and ("4А" or "4Б" or "4В" or "4Г") and "19Б") in y:
    skgl += 1
if "28Б" in y:
    skgl += 6
if "22Ж" in y:
    skgl += 1
if "22З" in y:
    skgl += 3
if "22И" in y:
    skgl += 5
if "22К" in y:
    skgl += 8
if "27Б" in y:
    skgl += 8
#ОВРССС
if ("12Б" or "13Б" or "13В" or "14Б" or "14В" or "16Б" or "17Б" or "18Б" or "19Б" or (("9Б" or "9В") and "10Б")
or (("9В" and '5Б' and ('8В' or '8Г' or '8Д')) and (('21В' or '21Г' or '21Д' or '21Е') or ('22Е' or '22Ж')))
or '20А' or ('СКГЛД' and ('5Б' or ('8В' or '8Г' or '8Д') or ("9Б" or "9В")))
or ('СКГЛВ' and ('5Б' or ('8В' or '8Г' or '8Д') or ("9Б" or "9В"))) or ('1Б' and ("4Е" or "4Ж") and ("5А" or "5В") and
"8Д" and ("21Д" or "21Е")) or ("1Б" and ("4Е" or "4Ж") and "5Б" and "8Г" and ('21Б' or '21В' or '21Г' or '21Д' or '21Е'))
or ("1Б" and ("4Е" or "4Ж") and "5Б" and "8Д") or ("1Б" and ("4Е" or "4Ж") and "5Б" and "8В" and ("21Д" or "21Е"))
or ("1А" and "4В" and "5Б" and "8Г" and ("21Д" or "21Е")) or ("1А" and "4В" and "5Б" and "8Д" and ('21В' or '21Г' or '21Д' or '21Е'))
or ("1А" and "4Г" and "5Б" and "8В" and ("21Д" or "21Е")) or ("1А" and "4Г" and "5Б" and "8Г" and ('21В' or '21Г' or '21Д' or '21Е'))
or ("1А" and "4Г" and "5Б" and "8Д") or ("1А" and "4Д" and "5Б" and ("8А" or "8Б") and ("21Д" or "21Е"))
or ("1А" and "4Д" and "5Б" and ('8В' or '8Г' or '8Д')) or ("1А" and ("4Е" or "4Ж") and "5Б" and ("8А" or "8Б") and ('21Б' or '21В' or '21Г' or '21Д' or '21Е'))
or ("1А" and ("4Е" or "4Ж") and "5Б" and ('8В' or '8Г' or '8Д')) or ("1А" and "4Г" and ("5А" or "5В") and "8Д" and ("21Д" or "21Е"))
or ("1А" and ("4Д" or "4Е" or "4Ж") and "8Г" and ("21Д" or "21Е")) or ("1А" and "4Д" and ("5А" or "5В") and "8Д" and ('21В' or '21Г' or '21Д' or '21Е'))
or ("1А" and ("4Е" or "4Ж" or "4Е" or "4Ж") and "8В" and ("21Д" or "21Е")) or ("1А" and ("4Е" or "4Ж") and ("5А" or "5В") and "8Г" and ('21В' or '21Г' or '21Д' or '21Е'))
or ("1А" and ("4Е" or "4Ж") and ("5А" or "5В") and '8Д')) in y:
   v = 'Очень высокий риск сердечно-сосудистых осложнений – более 10% в течение 10 лет. \
Рекомендуется снижение ЛПНП как минимум, на ≥50% от исходного уровня, цель <1,4 ммоль/л (<55 мг/дл). При повторном сосудистом событии в течение последних 2 лет целевой уровень ЛПНП <1 ммоль/л (<40 мг/дл).'
#ВРССС
if ("21Е" or "22Ж" or "8Д" or ("СКГЛД" and (not "5Б") and (not('8Б' or '8Г' or '8Д')) and (not ("9Б" or "9В"))) or
("СКГЛВ" and (not "5Б") and (not ("8В" or "8Г" or "8Д")) and (not ("9Б" or "9В"))) or
("9Б" or "9В" and "10А" and ("5Б" or ("8В" or "8Г" or "8Д") or ("21В" or "21Г" or "21Д" or "21Е") or ("22Е" or "22Ж"))) or
"20Б" or (("1Б" and "5Б" and "4Д" and "8В" and ("21В" or "21Г" or "21Д" or "21Е")) or ("1Б" and "5Б" and "4Д" and "8Г")) or
("1Б" and "5Б" and "4Д" and "8Д" and ("21А" or "21Б")) or
("1Б" and "5Б" and ("4Е" or "4Ж") and ("8А" or "8Б") and ("21В" or "21Г" or "21Д" or "21Е")) or
("1Б" and "5Б" and ("4Е" or "4Ж") and "8В" and ("21А" or "21Б" or "21В" or "21Г")) or
("1Б" and "5Б" and ("4Е" or "4Ж") and "8Г" and "21А") or
("1Б" and ("5А" or "5В") and "4Д" and "8Г" and "21Е") or
("1Б" and ("5А" or "5В") and "4Д" and "8Д" and ("21В" or "21Г" or "21Д" or "21Е")) or
("1Б" and ("5А" or "5В") and ("4Е" or "4Ж") and "8В" and ("21Г" or "21Д" or "21Е")) or
("1Б" and ("5А" or "5В") and ("4Е" or "4Ж") and "8Г") or
("1Б" and ("5А" or "5В") and ("4Е" or "4Ж") and "8Д" and ("21А" or "21Б" or "21В")) or
("1А" and ("5А" or "5В") and "4В" and "8Г" and "21Е") or
("1А" and ("5А" or "5В") and "4В" and "8Д" and ("21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and "4Г" and "8В" and ("21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and "4Г" and "8Г" and ("21Б" or "21В" or "21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and "4Г" and "8Д" and ("21А" or "21Б" or "21В")) or
("1А" and ("5А" or "5В") and "4Д" and ("8А" or "8Б") and ("21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and "4Д" and "8В" and ("21Б" or "21В" or "21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and "4Д" and "8Г" and ("21А" or "21Б" or "21В")) or
("1А" and ("5А" or "5В") and "4Д" and "8Д" and "21А") or
("1А" and ("5А" or "5В") and ("4Е" or "4Ж") and ("8А" or "8Б") and ("21Б" or"21В" or "21Г" or "21Д" or "21Е")) or
("1А" and ("5А" or "5В") and ("4Е" or "4Ж") and "8В" and ("21А" or "21Б" or "21В")) or
("1А" and ("5А" or "5В") and ("4Е" or "4Ж") and "8Г" and "21А") or
("1А" and "5Б" and "4В" and ("8А" or "8Б") and ("21Д" or "21Е")) or
("1А" and "5Б" and "4В" and "8В" and ("21В" or "21Г" or "21Д" or "21Е")) or
("1А" and "5Б" and "4В" and "8Г" and ("21А" or "21Б" or "21В" or "21Г")) or
("1А" and "5Б" and "4В" and "8Д" and ("21А" or "21Б")) or
("1А" and "5Б" and "4Г" and ("8А" or "8Б") and ("21В" or "21Г" or "21Д" or "21Е")) or
("1А" and "5Б" and "4Г" and "8В" and ("21А" or "21Б" or "21В" or "21Г")) or
("1А" and "5Б" and "4Г" and "8Г" and ("21А" or "21Б")) or
("1А" and "5Б" and "4Г" and ("8А" or "8Б") and ("21А" or "21Б" or "21В")) or
("1А" and "5Б" and "4Г" and "8В" and "21А") or
("1А" and "5Б" and ("4Е" or "4Ж") and ("8А" or "8Б") and "21А")) in y:
   v = 'Высокий риск сердечно-сосудистых осложнений – 5-10% в течение 10 лет. ' \
        'Рекомендуется снижение ЛПНП как минимум, на ≥50% от исходного уровня, цель <1,8 ммоль/л (<70 мг/дл)'
#УРССС
if (("9Б" and "4А" and (not ("5Б" or ("8В" or "8Г" or "8Д")) or ("21В" or "21Г" or "21Д" or "21Е") or "22Е" or "22Ж") and (not ("ВРССС" and "ОВРССС"))) or
("9В" and ("4А" or "4Б") and (not ("5Б" or ("8В" or "8Г" or "8Д")) or ("21В" or "21Г" or "21Д" or "21Е" or "22Е") or ("22Е" or "22Ж")) and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and "4В" and ("5А" or "5В") and ("8А" or "8Б") and ("21В" or "21Г" or "21Д" or "21Е" or "22Е") and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and "4В" and ("5А" or "5В") and "8В" and ("21Б" or "21В" or "21Г" or "21Д" or "21Е" or "22Е") and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and "4В" and ("5А" or "5В") and "8Г" and (not ("ВРССС" and "ОВРССС"))) or
("1Б"and "4В" and ("5А" or "5В") and "8Д" and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and ("4Г" or "4Д" or "4Е" or "4Ж") and ("5А" or "5В") and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and "4Б" and "5Б" and "8Д" and ("21Г" or "21Д" or "21Е" or "22Е") and (not ("ВРССС" and "ОВРССС"))) or
("1Б" and ("4В" or "4Г" or "4Д" or "4Е" or "4Ж") and "5Б" and (not ("ВРССС" and "ОВРССС"))) or
("1А" and ("4Б" or "4В" or "4Г") and "5Б" and (not ("ВРССС" and "ОВРССС"))) or
("1А" and ("4В" or "4Г" or "4Д" or "4Е" or "4Ж") and ("5А" or "5В") and (not ("ВРССС" and "ОВРССС"))) or
("1А" and "4Б" and ("5А" or "5В") and ("8А" or "8Б") and ("21В" or "21Г" or "21Д" or "21Е" or "22Е") and (not ("ВРССС" and "ОВРССС"))) or
("1А" and "4Б" and ("5А" or "5В") and "8В" and "21А" and (not ("ВРССС" and "ОВРССС"))) or
("1А" and "4Б" and ("5А" or "5В") and ("8Г" or "8Д") and (not ("ВРССС" and "ОВРССС"))) or
("1А" and ("4В" or "4Г" or "4Д" or "4Е" or "4Ж") and ("5А" or "5В") and (not ("ВРССС" and "ОВРССС")))) in y:
    v = 'Умеренный риск сердечно-сосудистых событий – 1-5% в течение 10 лет. Рекомендуется снижение ЛПНП <2,6 ммоль/л (<100 мг/дл)'
#НРССС
if (((not "УРССС") and (not "ВРССС") and (not "ОВРССС")) or ("4А" and (not "ВРССС") and (not "ОВРССС"))) in y:
    v = "Низкий риск сердечно-сосудистых событий – менее 1% в течение 10 лет. Рекомендуется снижение ЛПНП <3 ммоль/л (<116 мг/дл)"
#СКГЛД
if skgl > 8:
    v = 'Достоверный диагноз семейной комбинированной гиперлипидемии.'
#СКГЛВ
if skgl in [6, 7, 8]:
    v = 'Высоко вероятна семейная комбинированная гиперлипидемия. Рекомендовано подтверждение по генетическому анализу.'
#СКГЛВОЗ
if skgl in [3, 4, 5]:
    v = 'У пациента возможно наличие семейной гиперлипидемии. Рекомендован осмотр (поиск Ксантоматоза сухожилий или «дуги роговицы») или подтверждение по генетическому анализу.'
#МС
if (("1А" and ("6Б" or "6В") and ((("8В" or "8Г" or "8Д") and ("24В" or "24Г" or "24Д")) or (("8В" or "8Г" or "8Д") and "23А") or
(("8В" or "8Г" or "8Д") and "9Г") or (("8В" or "8Г" or "8Д") and "11Б") or (("24В" or "24Г" or "24Д") and "23А") or (("24В" or "24Г" or "24Д") and "9Г")
or (("24В" or "24Г" or "24Д") and "11Б") or ("23А" and "9Г") or ("23А" and "11Б") or ("9Г" and "11Б"))) or
("1Б" and "6В" and ((("8В" or "8Г" or "8Д") and ("24В" or "24Г" or "24Д")) or (("8В" or "8Г" or "8Д") and ("23А" or "23Б")) or
(("8В" or "8Г" or "8Д") and "9Г") or (("8В" or "8Г" or "8Д") and "11Б") or (("24В" or "24Г" or "24Д") and ("23А" or "23Б")) or (("24В" or "24Г" or "24Д") and "9Г")
or (("24В" or "24Г" or "24Д") and "11Б") or (("23А" or "23Б") and "9Г") or (("23А" or "23Б") and "11Б") or ("9Г" and "11Б")))) in y:
    v = 'Метаболический синдром '
#МОЖ1
if (("НРССС" and ("22А" or "22Б" or "23В" or "23Г" or "23Д") and ("5Б" or "6В" or ("30Б" or "30В" or "30Г") or ("31А" or "31Б"))) or
("УРССС" and ("22А" or "22Б" or "23В" or "23Г") and ("5Б" or "6В" or ("30Б" or "30В" or "30Г") or ("31А" or "31Б"))) or
("ВРССС" and ("22А" or "22Б" or "23В") and ("5Б" or "6В" or ("30Б" or "30В" or "30Г" or "31А" or "31Б")))) in y:
    v = 'Назначение лекарственной терапии дислипидемии не показано. Рекомендована модернизация образа жизни: \
•	здоровое питание с низким содержанием насыщенных жиров и предпочтительным употреблением цельнозерновых продуктов, овощей, фруктов и рыбы; \
•	отказ от алкоголя, курения; \
•	физическая активность 3,5-7 ч умеренной или интенсивной физической нагрузки в неделю или 30-60 мин в течение большинства дней.'
#МОЖ2
if (("НРССС" and ("22Е" or "22Ж") and ("4А" or "4Б" or "4В" or "4Г" or "4Д" or "4Е")) or
("УРССС" and ("22Д" or "22Е" or "22Ж") and ("4А" or "4Б" or "4В" or "4Г" or "4Д" or "4Е")) or
("ВРССС" and ("22А" or "22Б"))) in y:
    v = 'Назначение лекарственной терапии дислипидемии показано при неэффективности мероприятий по модернизации образа жизни: \
•	здоровое питание с низким содержанием насыщенных жиров и предпочтительным употреблением цельнозерновых продуктов, овощей, фруктов и рыбы;\
•	отказ от алкоголя, курения;\
•	физическая активность 3,5-7 ч умеренной или интенсивной физической нагрузки в неделю или 30-60 мин в течение большинства дней.\
Рекомендовано провести повторную оценку показателей липидного спектра через 2-3 месяца. При недостижении целевых значений липидов, назначить медикаментозную терапию.'
#ЛСМТ
if (("НРССС" and ("22З" or "22И" or "22К") and "32А" and "4А-Е") or
("УРССС" and ("22З" or "22И" or "22К") and "32А" and ("4А" or "4Б" or "4В" or "4Г" or "4Д" or "4Е")) or
("ВРССС" and ("22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and "32А") or
("ОВССС" and ("22В" or "22Г" or "22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and "32А")) in y:
    v = 'Пациенту показано назначение липидснижающей медикаментозной терапии наряду с соблюдением рекомендаций по диете и режиму физической активности.'
#Анализы
if "25Г" or "26Г":
    v = 'Следует провести дополнительный анализ крови на уровень АЛТ и КФК.'
#Статины
if (("ЛСМТ" and ("32Б" or "32В" or "32Г" or "32Д" or "32Е" or "32Ж" or "32З" or "32И" or "32К") and "33А" and "2А") or
("9Б" and ("ВРССС" or "ОВРССС") and "2А" or "9В" and "ОВРССС") and ("22В" or "22Г" or "22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and "2А" or
("9В" and "ВРССС" and ("22Г" or "22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and "2А")) in y:
    v = 'Пациенту показано назначение статинов наряду с соблюдением рекомендаций по диете и режиму физической активности.\
Липидный спектр, АЛТ и КФК следует повторно оценить через 4–6 недель после назначения или коррекции дозы.'
#НЭСтатины
if "ЛСМТ" and "32Б" in y:
    v = 'Неэффективность статинов. Требуется повышение дозы препарата, выбор другого статина или дополнение терапии другими группами липидснижающих лекарств'
#PCSK9
if (("СКГЛД" and "37А" and ("20Б" or "20В" or "20Г")) or ("СКГЛВ" and "37А" and ("20Б" or "20В" or "20Г")) or
("НЭЛСТ" and "37А" and ("20Б" or "20В" or "20Г")) or ("НЭСтатины" and "37А" and ("20Б" or "20В" or "20Г")) or
(("ЛСМТ" or "МОЖ2") and "33Б" and ("20Б" or "20В" or "20Г")) or
("ЛСМТ" and ("32Б" or "32В" or "32Г" or "32Д" or "32Е" or "32Ж" or "32З" or "32И" or "32К") and "33А" and ("2Б" or "2В")) or
("9Б" and ("ВРССС" or "ОВРССС") and ("2Б" or "2В")) or
("9В" and "ОВРССС "and ("22В" or "22Г" or "22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and ("2Б" or "2В")) or
("9В" and "ВРССС" and ("22Г" or "22Д" or "22Е" or "22Ж" or "22З" or "22И" or "22К") and ("2Б" or "2В"))) in y:
    v = 'Пациенту показано назначение блокаторов PCSK9, а также соблюдение рекомендаций по диете и режиму физической активности.'
#НДС
if (("ЛСМТ" and "НРССС" and ("4А" or "4Б" or "4В" or "4Г" or "4Д" or "4Е") and ("20А" or "20Б" or "20В" or "20Г") and ("22А" or "22Б" or "22В" or "22Г" or "22Д" or "22Е" or "22Ж")) or
("ЛСМТ" and "20А" or "20Б" and ("4А" or "4Б" or "4В" or "4Г" or "4Д" or "4Е")) or ("ЛСМТ" and "4Ж" and ("20А" or "20Б" or "20В" or "20Г"))) in y:
    v = 'Следует начать терапию невысокими дозами статинов:\
•	Аторваститин 20-40 мг \
•	Розувастатин 10-20 мг\
•	Симвастатин 10 мг\
•	Правастатин 10-20 мг\
•	Ловастатин 20 мг\
•	Флувастатин 20 мг\
•	Питавастатин 1 мг\
Липидный спектр, АЛТ и КФК следует повторно оценить через 4–6 недель после назначения или коррекции дозы.'
#НДСПП
if "ЛСМТ" and "20Д" in y:
    v = 'При наличии почечного трансплантата рекомендованы следующие дозы статинов:\
•	Аторваститин 10-40 мг \
•	Розувастатин 5 мг\
•	Симвастатин 5-10 мг\
•	Правастатин 10-20 мг\
•	Ловастатин 10-20 мг\
•	Флувастатин 10-20 мг\
Липидный спектр, АЛТ и КФК следует повторно оценить через 4–6 недель после назначения или коррекции дозы.'
#Омега-3
if (("ЛСМТ" and ("24В" or "24Г" or "24Д") and ("ВРССС" or "ОВРССС")) or ("32Б" and ("24В" or "24Г" or "24Д") and ("ВРССС" or "ОВРССС"))) in y:
    v = 'В дополнение к терапии статинами, следует добавить Омега-3 полинасыщенные жирные кислоты'








